[
  {
    "name":"Planning",
    "data": {
      "Risks": [
        "According to Deloitte, 36% of Enterprise Networks and Business Systems cited IP protection as top concern. 50% of companies isolate ICS networks, and 31% of companies don't conduct ICS assessments. This leaves Industrial control systems highly vulnerable to hacking. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf ",
        "A distributed denial-of-service (DDOS) is when bad actors flood networks with traffic to try encrypt and steal data. This can be seen by a concerning amount of traffic on a single IP, or lots of the same profile types, or uncommon traffic behaviors. Link-https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/ ",
        "Dragos Inc., a global leader in cybersecurity for operational technology announced bad activity groups, Kostovite, Petrovite and Erythrite, that target organizations in Canada and US stealing user and administrative credentials for ICS/OT systems. They can poison search engines and deploy of credential stealing malware. Link-https://ai-techpark.com/dragos-inc-released-5th-annual-ics-ot-cybersecurity-yir-report/ "
      ],
      "Mitigations": [
        "Lots of companies have a general set of requirements for every original equipment manufacturer. Companies should design individual requirements for each OEM to remain in best practice. ",
        "50% of companies perform ICS vulnerability testing on their supply chains less than once a month, businesses should just try to get that number up because a top concern is increasing sophistication of threats. ", 
        "According to Deloitte, the top three quick cyber initiatives that can be done are implementing data prevention programs, increasing employee awareness and training, and increase cyber risk assessments. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf"
      ]
    }
  },
  {
    "name": "Supplying",
    "data": {
      "Risks": [
        "Supplier personnel, particularly those with access to data, systems, or customer facilities. Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf",
        "Vendor service providers; ranging from janitorial services to system maintenance, anyone with access to company info. Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf",
        "Vendor products and software, especially products with embedded IT that will go into customer systems. Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf",
        "Security vulnerabilities can arise from supplier partners, like other tiers, service providers, and cloud services.  Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf",
        "While IoT devices are involved in manufacturing and finished vehicles, suppliers should also ensure that any IoT devices used in their own processes are secure as IoT devices are generally vulnerable. Link-https://www.tripwire.com/state-of-security/auto-industry-higher-risk-cyberattacks",
        "Electric power grids and power stations are easily exploitable by hackers. Link-https://www.afr.com/companies/energy/cyber-risk-in-adding-electric-cars-to-grid-20221012-p5bpav"
      ],
      "Mitigations": [
        "People mitigation: restricting user access and train employees on best practices. Link-https://www.tripwire.com/state-of-security/auto-industry-higher-risk-cyberattacks",
        "Process mitigation: supplier vetting, evaluating physical and cybersecurity processes, including having requirements in agreements and contracts. Beyond tier 1: managing and centralizing supplier risk management. Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf ",
        "Process mitgation: careful vendor selection and management, see link for a full list of best practices. Link-https://csrc.nist.gov/CSRC/media/Projects/Supply-Chain-Risk-Management/documents/briefings/Workshop-Brief-on-Cyber-SCRM-Vendor-Selection-and-Management.pdf",
        "Tech mitigation: hire and vet third party vendors used for supply chain services. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=45"

      ]
      }
    }
  },
  {
    "name": "InventoryManagement",
    "data": {
      "Risks": [
        "Stuxnet is first known software designed to interrupt operational technology. It was designed to infect networks that were not connected to the internet. Triton was first identified when used to override essential safety shut down equipment This device used could be a USB key, that is plugged into one computer to shut down the entire network. This is a risk to inventory management because housing automotives of all years/makes/models requires physical machinery that can be hacked. Link-https://www.sciencedirect.com/topics/computer-science/stuxnet ",
        "Operational technology uses Internet of Things to function efficiently. Since a lot of the machinery and factories used to hold the automotive inventory are decades old, they can't receive remote updates unless owners take them offline. Doing this threatens the update of physical processes and makes it difficult for businesses to keep these assets secure. This can impact on market competitiveness and customer loyalty, financial losses, and reputational damage. ",
        "Only 20% of manufacturing companies say implementing a Secure Information and Event Management (SIEM) system is a priority. An SIEM system supports threat detection and security incident management by creating firewalls and antivirus filters. This is needed to protect the inventory and data. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manufacturing-cyber-risk-in-advanced-manufacturing-executive-summary.pdf ",
        "Vehicles use Internal vehicle communication system because they vary by manufacturer, year, model. They include the CAN bus (often at high, mid, and low speeds to prioritize functionality according to the speed of messages), keyword protocol (KWP), ethernet, and others. The CAN bus is the most important because it is typically the network that transmits messages for drive-by-wire features, including steering, acceleration, and braking. The risk here is splicing through electric control units, or anything on the exterior of the vehicle such as the tire pressure monitors. Link-https://www.nrel.gov/docs/fy19osti/74247.pdf"
        ],
      "Mitigations": [
        "Manufacturers need to have all of these best practices: the ability to recognize the threat and eliminate potential vulnerabilities in the system, take inventory of all their devices and machines, segment your network enough that it allows OT and IT to work together , use vulnerability management, use of encryption in addition to security standards, access control points, proper training on computer security systems, and raising awareness, use updated software, back up data, antivirus software, securing the entire vehicle’s networked functionalities with mechanical fail-safe mechanisms.  ", 
        "Air gapping, a security measure that isolates a computer or network and prevents it from creating an external connection, is a common approach to ICS security, when companies actually take the next step to test strategy and find fallacy. Link-https://www.techtarget.com/whatis/definition/air-gapping ",
        "Installing a network traffic monitoring and tampering alarm in the vehicle that detects unusual CAN messages (including messages sent at unusually high rates) and transmit a warning signal to fleet managers and manufacturer cybersecurity team is a smart practice that not enough manufacturers use. ", 
        "Implementing firewalls, whitelisting, and blacklisting of ECU messages to prevent unsafe commands and employing secure coding practices and auditing the source code  ensures that the right people are in control of machines and factories. " 
      ]
    }
  },
  {
    "name": "Manufacturing",
    "data": {
      "Risks": [
        "According to Deloitte, the top 10 cyberthreats affecting manufacturers are 1) theft of intellectual property; 2) phishing, pharming, related variants; 3) Increasing sophistication and proliferation of threats, 4) Security breaches that involve a third party, 5) Social engineering, 6) Employee errors and omissions 7) external financial fraud involving info systems, 8) Employee abuse of it systems and information, 9) Mobile devices, 10) Attacks exploiting mobile network vulnerabilities. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=7",
        "Ransomware is a major risk, with 49% of the top 100 automotive manufacturers are highly susceptible to ransomware attacks.  Link-https://www.centripetal.ai/blog/cybersecurity-in-the-automotive-industry-what-are-the-risks",
        "Software updates, creation, and authenticity are another major threat. Link-https://staysafeonline.org/resources/software-updates",
        "Digital car hacks/break-ins are an increasingly prescient concern with the rise of smart car technologies. Link-https://www.securitymagazine.com/articles/97932-automotive-industry-races-against-cybersecurity-threats ",
        "IoT devices and smart cars, both autonomous and connnected vehicles, can present many cybersecurity vulnerabillties, such as access to data centers, piracy, and identity theft. Link-https://ieeexplore.ieee.org/abstract/document/9138643/authors#authors",
        "4/10 top cyber threats are directly due to internal employees: phishing/pharming, direct abuse of IT systems, errors/omissions, and use of mobile devices. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=8",
        "The biggest manufacturing cyber threat for smaller firms (<500M in revenue): direct employee threats. Midsize (500M-5B in revenue): Intellectual property (IP) theft. Large firms (<5B): phishing and pharming threats, most often targeting financial gain or IP. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=8"

      ],
      "Mitigations": [
        "People mitigation: Restrict user access and train employees on best practices, invest in talent and organizational management. Remember that 75% of employees lack skilled resources and 4 out of the top 10 cyber threats for manufacturers involve employees.  Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=6",
        "People mitigation: Attract and retain cybersecurity talent. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=8",
        "People/process mitigation: Ensure executive and board level engagement. Take a top-down, risk-based approach to your cybersecurity processes. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=13",
        "People mitigation: Ensure clear ownership of a Chief information Security Officer (CISO) responsibilities / other cybersecurity duties. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=13",
        "People mitigation: Actively work with legal to make sure customer agreements clearly defines roles and responsibilities for connected product data ownership, product breach incidents, and other customer responsibilities for cyber risks. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "People mitigation: When working with third parties for cyber risk management, define requirements upfront in contracts and make sure there’s a right to audit against those requirements. Visit third-party locations to gain assurance. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=45",
        "Process mitigation: Ensure adherence to the Cybersecurity Disclosure Act of 2015, which requires all public companies to disclose the level of cybersecurity expertise in board of directors.  https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=18",
        "Process mitigation: Plan ahead before a breach occurs. In this planning, include connected products in incident response plans, employ tactics like wargaming exercises, and include ICS in incident response plans. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=13",
        "Process mitigation:  Perform ICS vulnerability testing at least once a month.  Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=13",
        "Process mitigation:  Perform a cyber risk assessment that includes enterprise, ICS, and connected products. If there's been one done in last 6 months: check if included advanced cyber risks like IP protection, ICS, connected products, and third-party risks related to industrial ecosystem relationships. https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=13",
        "Process mitigation:  Inventory, classify, and maintain IP and corresponding threats. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=33",
        "Process mitigation:  Reduce value of sensitive data to the threat actors. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=33",
        "Process mitigation:  Embed security-by-design principles and strong application security into processes.  Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "Process mitigation:  Update privacy and data use policies (including cross-border transfer should be updated to reflect current 24/7 data collection).  Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "Process mitigation:  Assess and limit new feature sets to connected products before release. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "Process mitigation:  Keep up previous data protection hygiene processes, like protecting data on collection, in transit and in storage on both device and storage. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "Process mitigation:  Evaluate enterprise efforts like cyber threat monitoring, wargaming simulations to make sure they’re comprehensive enough to cover cyber risks. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=43",
        "Tech mitigations: regular updates of systems, using updated anti-malware software, secure Industry 4.0 systems in manufacturing plants, segmenting networks: all IoT devices should be run on separate systems; secure telematics vehicle systems, implement IP Protection at the data layer; connected products: encrypt data, data loss prevention programs. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf#page=6"
      ]
      }
    }
  },
  {
    "name": "Delivery",
    "data": {
      "Risks": [
        "Software platforms use application programming interfaces (APIs). APIs facilitate the activation of vehicle features and delivery of subscription-based services: remote unlock, remote start, and enhanced equipment. Manufacturers need to protect APIs from malicious actors seeking access to mission-critical systems and sensitive data. Ransomware can be installed from USB port, CD/DVD port, Bluetooth, Wi-Fi at electric vehicle charging stations. Link-https://www.escrypt.com/sites/default/files/documents/Ransomware-against-cars.pdf ",
        "Cyber criminals would send TOR-based botnet such as MIREI which provides more than 400,00 bot clients. Tor allows for anonymous services that can: retrieve downloads and websites from vehicles, interpret SMS and emails within vehicles, hack into personal devices connected by bluetooth, hack into traffic infrastrucutres, and third parties such as insurance and trailers. ",
        "NIST predicts the smart grid as a future method for delivery systems, which may come with new cyber vulnerabilities. Link-https://www.nist.gov/speech-testimony/effectively-transforming-our-electric-delivery-system-smart-grid "
      ],
      "Mitigations": [
        "When delivering these vehicles, companies should secure the complete vehicle system from the electric control unit to the cloud backend. ",
        "Manufacturing companies should complete a full testing of the vehcicle before distributing them out for any painpoints or not secure parts."
      ]
    }
  },
  {
    "name": "CustomerSupport",
    "data": {
      "Risks": [
        "The customer support step of the supply chain is extremely important because bad actors can use ransomware or phishing to steal victims’ data. These hackers can compromise customer database and leverage details to conduct follow up attacks causing a manufacturing data breach. ",
        "Over 50% of manufacturers have mobile apps with their connected product, such as Tesla's app to control the car.  76% companies choose Wi-Fi to enable data flows between products which is highly hackable. 52% said their products are able to store/transmit confidential data including social security/banking information. More than 40% of companies don't account for these risks in their incident response plan which leaves them vulnerable for a bad actor to sell to a competing group, criminal enterprise, or nation state actor. Link-https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-manu-cyber-risk-in-advanced-manufacturing.pdf"
      ],
      "Mitigations": [
        "Manufacturing companies should ensure full traceability of software versions and vehicle configuration along the vehicle lifecycle, so if there is foul play they are able to track it. Since automotive companies use a lot of external resources and services it is vital to understand everything that is coming in and out of their supply chain. ",
        "Car makers need to communicate testing results to third party car sellers to create security requirements that vendors need to follow since car data by customer is very valuable. ",
        "When providing software updates remotely, be positive that it is safe to do so by testing thoroughly and creating updates that don't impact security while sending. "

      ]
    }
  }
]