[
    {
        "name": "Planning",
        "data": {
            "Risks": [
                "The infrastructure- or virtual/physical equipment on which the software operates- such as virtual machines, servers, storage, and networking devices- are prone to misconfiguration errors, or errors due to poor construction of any component of the infrastructure. Link-https://circleci.com/blog/secure-software-supply-chain/",
                "Cloud misconfiguration errors can lead to system outages which can give hackers time to plan and perform their cyber attacks Link-https://circleci.com/blog/cloud-misconfiguration/",
                "Improper planning can lead to many cybersecurity vulnerabilities that will be very hard to undo once code becomes more complex Link-https://circleci.com/blog/cloud-misconfiguration/"
            ],
            "Mitigations": [
                "G2 Supply Chain Planning Software Link-https://www.g2.com/categories/supply-chain-planning",
                "Have a team dedicated to taking the time to thoroughly investigate on which components to use especially dependencies and assess all vulnerabilities Link- https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Synopsis Black Duck which offers its a Software Bill of Materials (SBOM) detailing the contents of one’s code, its origin, and any associated security or license risks. Link- https://www.synopsys.com/software-integrity/security-testing/software-composition-analysis.html?utm_source=google&utm_medium=cpc&utm_term=black_duck_synopsys&utm_campaign=G_S_Black_Duck_Brand_tCPA&cmp=ps-SIG-G_S_Black_Duck_Brand_tCPA&gclid=Cj0KCQiApb2bBhDYARIsAChHC9u5KO8awWQByP3m9hsgZEPpL2olszEvC0YAZuZMlwCx3OVBeoM4czoaAsEIEALw_wcB",
                "Implement automated vulnerability scanning technology Link-https://www.sonatype.com/resources/software-supply-chain-management-part-1-what-is-a-software-supply-chain",
                "Have dedicated team set up schedule to perform regular risk assessments of all components Link-https://www.sonatype.com/resources/software-supply-chain-management-part-1-what-is-a-software-supply-chain"
            ]
        }
    },
    {   
        "name": "Supplying",
        "data": {
            "Risks": [
                "Anyone has access to open source code which means anyone can commit unwanted changes to the code Link- https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Directly inserting malicious code to open source code Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Hacker taking over committer account Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Compromising signing keys can mess with the distribution of the software Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Inserting backdoor-  or cyberattack through means of malware, viruses, or technology to get unauthorized access to the network or system- to get botnet access or a group of interconnected networks to perform cyber attacks",
                "After attacking the supply chain through means such as inserting malicious code Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Hackers can insert malware for cryptomining Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "•Inserting backdoors for botnet access can lead to denial of service, or DDoS, attacks, stolen data, sent spam Link- https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "•Dependencies can change at a more rapid pace which can pose unknown security risks at any time if developers do not stay up-to-date Link- https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/"
            ],
            "Mitigations": [
                "Microsoft Defender Antivirus Link-https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/microsoft-defender-antivirus-windows?view=o365-worldwide",
                "Patching dependencies and staying up-to-date with potential vulnerabilities of dependencies in use and patching software. The following GitHub’s SCA (software composition analysis) tools can help manage dependencies in use: (1) Dependency graph (2) Dependabot alerts (3) Dependabot security updates (4) Dependabot version updates Link-https://github.blog/2020-09-02-secure-your-software-supply-chain-and-protect-against-supply-chain-threats-github-blog/",
                "Synopsis products: (1) Synopsys Black Duck® software composition analysis (SCA) helping teams manage the security, quality, and license compliance risks as a result using open source and third-party code in applications and containers. They also offer a Software Bill of Materials (SBOM) detailing the contents of one’s code, its origin, and any associated security or license risks. (2) Coverity® is a fast, accurate, and highly scalable static application security testing (SAST) solution that helps development and security teams address security and quality defects early in the software development life cycle (SDLC), track and manage risks across the application portfolio, and ensure compliance with security and coding standards. (3) WhiteHat Dynamic delivers fast and easy dynamic application security testing (DAST), optimized for developer needs. Link- https://www.synopsys.com/software-integrity/security-testing/software-composition-analysis.html?utm_source=google&utm_medium=cpc&utm_term=black_duck_synopsys&utm_campaign=G_S_Black_Duck_Brand_tCPA&cmp=ps-SIG-G_S_Black_Duck_Brand_tCPA&gclid=Cj0KCQiApb2bBhDYARIsAChHC9u5KO8awWQByP3m9hsgZEPpL2olszEvC0YAZuZMlwCx3OVBeoM4czoaAsEIEALw_wcB"
            ]
        }
    },
    {
        "name": "InventoryManagement",
        "data": {
            "Risks": [
                "IT administrators will manage all these tasks using simple excel sheet records Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory",
                "Software installations can have viruses especially if not downloaded from a trusted source Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory",
                "IT administrators managing all IT assets and software industry can become overwhelmed and stress leading to human errors which can create cybersecurity vulnerabilities Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory",
                "Viruses from software installations can lead to entire databases being wiped out and ransomware attacks Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory",
                "Security breaches of third parties where clients chose to host their SAM (software asset management) Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory"
            ],
            "Mitigations": [
                "Efficient IT Asset Management Software tools such as: (1) Microsoft Defender Advanced Threat Protection (2) Flexera SAM (Software Asset Management) (3) ServiceNow SAM (4) G2 SAM Link- https://truedigitalsecurity.com/blog/a-better-way-to-manage-your-software-inventory"
            ]
        }
    },
    {
        "name": "Manufacturing",
        "data" : {
            "Risks": [
                "According to NIST, Intentional threats, whether from external injection attacks or malicious insiders, can be the most difficult to find since they are often masked to appear as an already validated component. Attackers seeds popular repositories with harmful packages, hack into maintainers’ accounts to alter existing packages, or inject code into compromised source repositories are frequently used methods of enabling backdoor access for an attack. Finding these attacks after deployment is typically too late; the damage has been done, and it can be very costly. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "For instance, Trojan horses, bots, ransomware, crypto miners, and spyware are often delivered as payloads via the more benignly introduced vulnerability types. Link-https://us-cert.cisa.gov/ncas/alerts/TA17-181A",
                "An instance of a supply chain attack is SolarWinds. 2020 – An IT management company was infiltrated by a foreign threat actor who maintained persistence in its network for months. The threat actor left the network only after it had compromised the company’s build servers and used its update process to infiltrate customer networks. To learn more about this attack, use the attached reference. Link-https://en.wikipedia.org/wiki/SolarWinds",
                "Quantum computing is increasingly gaining traction, with big tech companies setting out plans to deliver high-powered quantum computing hardware in the next few years. The power of quantum computing could provide benefits for society in several ways, particularly when it comes to science, research, analyzing algorithms, as well as improving artificial intelligence and machine learning. But there's the risk that the rise of quantum computing poses a threat to traditional cybersecurity and encryption as we know it because quantum computers could break public-key cryptography -- it's something the White House has warned could be a threat to businesses and national security. Link-https://www.infosecurity-magazine.com/news/quantum-computing-data-risk-cyber/",
                "Below mentioned are the potential risks and vulnerable areas which could affect the supply chain during manufacturing:",
                "5G-connected devices - In a world of interconnected networks, devices, and applications, every activity is a potential attack vector. This vulnerability is only heightened by the nature of 5G and its highly desirable attributes. The world’s hackers (good and bad) are already turning to the 5G ecosystem, as the just concluded DEFCON 2019 (the annual ethical “hacker Olympics”) illustrated. The targets of this year’s hacker villages included key parts of the 5G ecosystem such as: aviation, automobiles, infrastructure control systems, privacy, retail call centers and help desks, hardware in general, drones, IoT, and voting machines. Link-https://www.brookings.edu/research/why-5g-requires-new-approaches-to-cybersecurity/",
                "Ransomware - According to Sonic wall Cyber threat 2022 report the ransomware in supply chain attacks has become more ruthless. They have attempted to cripple food networks, water supplies, and fuel distribution networks as well as hospitals and city governments. Link-https://online.maryville.edu/blog/supply-chain-attack/#:~:text=A%20supply%20chain%20attack%20breaks,its%20many%20suppliers%20and%20partners.",
                "Phishing - Phishing is the most common attack vector and played a part in over a third of all breaches in 2021. One area where this type of attack is particularly on the rise is in the supply chain. By breaching one organization and exploiting its third-party connections, attackers can access dozens, or hundreds, of others. When attackers use phishing to target a supply chain, they often employ spear-phishing and social engineering techniques to make emails appear like they came from someone the recipient knows and trusts. Link-https://www.xorlab.com/en/blog/5-supply-chain-attacks-that-started-with-a-phishing-email-how-to-prevent-them",
                "Insider Threats - According to National Counterintelligence and Security Center, it is important to note that insider threat programs target anomalous activities. Therefore national Insider threat rask force(NIITF) helps build in protection against infringing upon employees' civil rights, privacy and whistleblower protection. Link-https://www.dni.gov/index.php/ncsc-what-we-do/ncsc-supply-chain-threats",
                "Malware - Supply chain attacks are an emerging kind of threat that target software developers and suppliers. The goal is to access source codes, build processes, or update mechanisms by infecting legitimate apps to distribute malware. Link-https://learn.microsoft.com/en-us/microsoft-365/security/intelligence/supply-chain-malware?view=o365-worldwide"
            ],
            "Mitigations": [
                "Access control – Internal package repositories must limit write access to key roles and team members through permissions and secure authentication (including multi-factor authentication) that’s consistent across the organization. Link-https://jfrog.com/blog/log4shell-0-day-vulnerability-all-you-need-to-know/",
                "Proxy repositories – Caching external repositories (such as Maven Central and npm) can provide an immutable snapshot of third-party resources, so any subsequent malicious overwrite will be immediately evident. Link-https://jfrog.com/blog/malicious-packages-are-a-rising-threat-in-software-supply-chain-attacks/",
                "Testing and analysis – Sophisticated static and dynamic analysis tools can detect and flag malicious code and malicious behaviors of questionable packages. The JFrog security research team has uncovered and disclosed over 1300 malicious packages in public package repositories through tools it has developed. Link-https://jfrog.com/blog/malicious-packages-are-a-rising-threat-in-software-supply-chain-attacks/",
                "Using deliberate network segmentation, organizations can mitigate the effects of software vulnerabilities and associated exploits, as well as aid incident response and recovery. Segmentation helps confine a vulnerability or attack to portion of a customer’s enterprise. Organizations can also achieve such mitigation by implementing endpoint-based micro-segmentation with host-based firewalls or agents. Microsegmentation can be part of a “zero trust” architecture or implemented on its own. Link- https://doi.org/10.6028/NIST.SP.800-207"
            ]
        }
    },
    {
        "name": "Delivery",
        "data": {
            "Risks": [
                "In 2012 researchers from a major U.S. software company investigating counterfeit software found malware preinstalled on 20 percent of devices they tested. The malware was installed in new desktop and laptop computers after they were shipped from a factory to a distributor, transporter, or reseller. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "The malware installed in new desktop and laptop computers after they were shipped from a factory to a distributor, transporter, or reseller are risky. For instance, in 2019 a researcher bought old computers, flash drives, phones and hard drives, and found only two properly wiped devices out of 85 examined. Also found were hundreds of instances of personally identifiable information (PII) spillage, including Social Security numbers, passport numbers, and credit card numbers. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "Threat actor used a routine update to deliver a malicious backdoor. Similar situation happened in 2020 when thousands of public and private networks were infiltrated when a threat actor used a routine update to deliver a malicious backdoor. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "Most modern software receives routine updates to address bugs and security issues. Software vendors typically distribute updates from centralized servers to customers as a routine part of product maintenance. Threat actors can hijack an update by infiltrating the vendor’s network and either inserting malware into the outgoing update or altering the update to grant the threat actor control over the software’s normal functionality. For example, the NotPetya attack occurred in 2017 when Russian hackers targeting Ukraine spread malware through tax accounting software popular in Ukraine. What would later be called the NotPetya malware spread well beyond Ukraine and caused major global disruptions in crucial industries, including international shipping, financial services, and healthcare. Link- https://www.cisa.gov/uscert/ncas/alerts/TA17-181A",
            ],
            "Mitigations": [
                "NIST suggests practices to assist in protecting software and producing well secured software. These include firstly, Defining criteria for software security checks to help ensure that the software resulting from the SDLC meets the vendor’s expectations when it checks the software’s security during development. Secondly, supplying software that satisfies security requirements and mitigates security risks through design decisions. Thirdly, protecting code from unauthorized access and tampering. Finally, verifying that third-party software, such as libraries and other packages incorporated into vendor code, complies with security requirements. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "The steps to mitigate these risks as per National Institute of Standard and Technologies are mentioned in following points. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "First, establish an organization-wide HVA governance program.",
                "Second, identify and prioritize HVA information systems.",
                "Third, consider the interconnectivity and dependencies of information systems when determining which systems are HVAs.",
                "Fourth, develop a methodology for prioritizing HVAs based on criticality and mission importance.",
                "Fifth, develop an assessment approach based on HVA prioritization.",
                "Finally, Ensure timely remediation of identified vulnerabilities. Vendors can use the SSDF to prevent malicious software content or vulnerabilities from entering the cyber supply chain."
                
            ]
        }
    },
    {
        "name": "CustomerSupport",
        "data": {
            "Risks": [
                "The annual Cost of a Data Breach Report, featuring research by Ponemon Institute, offers insights from 550 real breaches to help you understand cyber risk in a changing world. This report has become a leading benchmark tool, offering IT, risk management and security leaders a lens into factors that tend to increase, or help mitigate, the cost of data breaches. According to this report data breach costs surged 13% from 2020 to 2022. Link-https://www.ibm.com/account/reg/in-en/signup?formid=urx-51643",
                "End-User Device Malware, 2012 – Researchers from a major U.S. software company investigating counterfeit software found malware preinstalled on 20 percent of devices they tested. The malware was installed in new desktop and laptop computers after they were shipped from a factory to a distributor, transporter, or reseller. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "In December 2020, the cybersecurity firm FireEye discovered a backdoor – subsequently named SUNBURST - in the SolarWinds Orion platform. Researchers later discovered that a threat actor used an implant, referred to as SUNSPOT, to access the build server and insert the backdoor. After spreading the backdoor to many customers via routine updates, the threat actor targeted select victim networks for follow-on actions, including the use of additional malware. This software supply chain attack provided the threat actor access to systems and data on numerous government and private sector networks. The threat actor was patient, thorough, and maintained excellent operational security throughout the process, making their presence very hard to detect. Overall, the threat actor maintained a light malware footprint, using legitimate credentials and remote access when possible. While the SolarWinds Orion platform compromise provided access to most of the threat actor’s victims, the threat actor used non-supply chain compromise techniques to gain access to a limited number of victims. The software supply chain attack conducted against SolarWinds and its customers serves as a recent example of how effective a software supply chain attack can be. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf"
            ],
            "Mitigations": [
                "Network defenders are limited in their ability to quickly mitigate consequences after a threat actor has compromised a software supply chain. This is because organizations rarely control their entire software supply chain and lack authority to compel every organization in their supply chain to take prompt mitigation steps. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "Due to the difficulty of mitigating consequences after a software supply chain attack occurs, network defenders should observe industry best practices before an attack has occurred. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf",
                "Implementing best practices will bolster an organization’s ability to prevent, mitigate, and respond to such attacks. Every organization should monitor configuration settings to focus on maintaining the integrity of hardware, software, and firmware. For example, monitoring can identify unauthorized changes to Trusted Platform Module (TPM) configurations, such as those that establish which TPM features are enabled. Similarly, an organization should monitor configurations that establish a vendor- or user-defined hardened state and whether unauthorized changes to those configurations occur. Link-https://www.cisa.gov/sites/default/files/publications/defending_against_software_supply_chain_attacks_508_1.pdf"
            ]
        }
    }
]